import numpy as np

# Создаем массив с помощью NumPy
array = np.array([1, 2, 3, 4, 5])

# Вычисляем сумму всех элементов массива
sum_elements = np.sum(array)


print("Сумма элементов массива:", sum_elements)



# Библиотека NumPy нужна для работы с числами и данными в виде массивов, чтобы делать это быстро и удобно.
# Ускоряет вычисления. Она намного быстрее, чем работа с обычными списками Python, особенно если данные большие.
# Облегчает работу с массивами и матрицами. Например, легко добавлять, умножать, находить среднее или максимум.
# Упрощает научные и математические задачи. Например, вычисление статистики, решение уравнений, работа с большими наборами данных.